// Задача 12
// Напишете Word-Chain игра, в която на играча се дават две произволни думи и целта на играта е с последователност от
// промени по думата, да се стигне от едната до другата дума. Промените могат да са само: промяна на буква, добавяне на буква,
// премахване на буква, размяна на две букви. Един ход е валиден само ако новообразуваната от играча дума съществува (е
// открита във файла от предходните задачи). Пример: slow > flow > flog > frog > frig > brig > brag > bag > sag > sat > fat > fast