// Задача 31
// Напишете програма, която принтира следната информация за въведен от потребителя текст на няколко реда:
// ● Общ брой символи
// ● Общ брой букви
// ● Общ брой главни букви
// ● Общ брой малки букви
// ● Общ брой гласни букви
// ● Общ брой съгласни букви
// ● Общ брой думи (последователност от символи, отделени с whitespace)
// ● Общ брой цифри
// ● Първия уникален символ от текста ако има такъв
// ● Най-дългата дума
// ● Най-дългата дума, съставена от уникални символи (без повтарящи се символи)